config.org
#+title: doom-emacs config
#+startup: overview
#+PROPERTY: header-args:elisp :noeval

* General
** User Information
:PROPERTIES:
:ID:       47537e03-28e5-4adf-ac0b-ab8249ce01bf
:END:

Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.

#+BEGIN_SRC elisp
(setq user-full-name "Stefan Lendl"
      user-mail-address "ste.lendl@gmail.com")
#+END_SRC

** literate config
*** Don't auto-recompile literate-config
:PROPERTIES:
:ID:       7f52c1ee-6fff-4e04-96fa-8c5a2bf3ad14
:END:

#+BEGIN_SRC elisp
(remove-hook 'org-mode-hook #'+literate-enable-recompile-h)
#+END_SRC

*** private config file
:PROPERTIES:
:ID:       b1cd6206-b586-45d7-8b1f-e03823bde124
:END:

~doom/goto-private-config-file~ goes to ~config.el~ which I will never edit by hand.
Opening ~config.org~ makes much more sense.

#+begin_src elisp
(defun stfl/goto-private-config-file ()
  "Open your private config.el file."
  (interactive)
  (find-file (expand-file-name "config.or
#+begin_src elisp
(use-package! lsp-bridge
  :config
  (setq! lsp-bridge-user-langserver-dir (doom-path doom-private-dir "langserver")
         lsp-bridge-enable-inlay-hint t
         lsp-bridge-enable-hover-diagnostic t
         ;; lsp-bridge-enable-signature-help t
         ;; lsp-bridge-enable-auto-format-code nil
         ;; lsp-bridge-enable-org-babel t
         lsp-bridge-log-level 'default
         ;; acm-enable-capf t
         )
  ;; (map! :map ?? lsp-bridge-map)
  (global-lsp-bridge-mode))
#+end_src

** Code Formatting



mapping doom's ~+format/buffer~ and ~+format/region~

#+begin_src elisp
(map! (:when (modulep! :editor format)
       :v "g Q" '+format/region
       :v "SPC =" '+format/region
       :leader
       :desc "Format Buffer" "=" #'+format/buffer
       (:prefix ("b" "+buffer")
        :desc "Format Buffer" "f" #'+format/buffer)))
#+end_src

** PHP
:PROPERTIES:
:ID:       1a38710f-565e-4680-bc53-b39f3d955b71
:END:

#+BEGIN_SRC elisp
(after! (lsp-mode php-mode)
  (setq lsp-intelephense-licence-key (get-auth-info "intelephense" "ste.lendl@gmail.com")
        lsp-intelephense-files-associations '["*.php" "*.phtml" "*.inc"]
        lsp-intelephense-files-exclude '["**update.php**" "**/js/**" "**/fonts/**" "**/gui/**" "**/upload/**"
                                         "**/.git/**" "**/.svn/**" "**/.hg/**" "**/CVS/**" "**/.DS_Store/**"
                                         "**/node_modules/**" "**/bower_components/**"
                                         "**/vendor/**/{Test,test,Tests,tests}/**"]
        lsp-auto-guess-root nil
        lsp-idle-delay 0.8))
#+END_SRC

** Python
*** poetry

Poetry needs to scan for a project whenever a new file is opened. Tracking via
projectile speeds this up significantly.

#+begin_src elisp
(after! poetry (setq poetry-tracking-strategy 'projectile))
#+end_src

*** conda

automatically activate a conda environment if present in a project

#+begin_src elisp
(after! conda (conda-env-autoactivate-mode))
#+end_src

projectile does not recognize conda projects

#+begin_src elisp
(after! projectile
  (projectile-register-project-type 'python-conda '("environment.yml")
                                    :project-file "environment.yml"
                                    :compile "conda build"  ;; does not exist
                                    :test "conda run pytest"
                                    :test-dir "tests"
                                    :test-prefix "test_"
                                    :test-suffix"_test"))
#+end_src

*** numpydoc.el

#+begin_src elisp :tangle packages.el
;; (package! numpydoc)
#+end_src

#+begin_src elisp
;; (use-package! numpydoc
;;   :after python-mode
;;   :commands numpydoc-generate
;;   :config
;;   (map! :map python-mode-map
;;         :localleader
;;         :prefix ("d" . "docstring")
;;         :desc "Generate Docstring" "d" #'numpydoc-generate))
#+end_src

*** emacs ipython notebook (ein)

ein displays images in a separate window by default. Use inline images instead

#+begin_src elisp
(after! ein
  (setq! ein:output-area-inlined-images t
         ein:worksheet-warn-obsolesced-keybinding nil))
#+end_src

To enable this in the notebook, configure matplotlib to produce inline images.

#+begin_src python :tangle nil
%matplotlib inline
#+end_src

don't kill the *ein: buffer with ~ESC~ which causes the buffer not to work properly

org babel integration for ein

#+begin_src elisp
(when (modulep! :tools ein)
  (after! org
    (require 'ob-ein)))
#+end_src

*** emacs-jupyter

header arguments to for jupyter-python to work with plotly

#+begin_src elisp
(after! org
  (setq org-babel-default-header-args:jupyter-python
        '((:results . "value")
          (:session . "jupyter")
          (:kernel . "python3")
          (:pandoc . "t")
          (:exports . "both")
          (:cache . "no")
          (:noweb . "no")
          (:hlines . "no")
          (:tangle . "no")
          (:eval . "never-export"))))
#+end_src

*** Debug Test at point workaround

debugging python tests at point do not work with the default configuration.
might be merged upstream: https://github.com/emacs-lsp/dap-mode/pull/590

#+begin_src elisp
(after! (python-mode dap-mode)
  (dap-register-debug-template "Python :: Run pytest (at point) -- Workaround"
                             (list :type "python-test-at-point  "
                                   :args ""
                                   :program nil
                                   :module "pytest"
                                   :request "launch"
                                   :name "Python :: Run pytest (at point)")))
#+end_src

** Rust

#+begin_src elisp
(map!
 :mode rustic-mode
 :map rustic-mode-map
 :localleader
 :desc "rerun test" "t r" #'rustic-cargo-test-rerun
 )
#+end_src

#+begin_src elisp
(after! rustic
  (when (executable-find "cargo-nextest")
    (setq! rustic-cargo-test-runner 'nextest)))
#+end_src

Configure inlay type hints

This requires ~lsp-inlay-hint-enable~ as configured in [[* Inlay Hints][LSP/Inlay Hints]]

#+begin_src elisp
(after! lsp-rust
  (setq! lsp-rust-analyzer-binding-mode-hints t
  ;;        lsp-rust-analyzer-display-chaining-hints t
  ;;        lsp-rust-analyzer-display-closure-return-type-hints t
         lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial"
  ;;        lsp-rust-analyzer-display-parameter-hints t
  ;;        lsp-rust-analyzer-hide-named-constructor t
         lsp-rust-analyzer-max-inlay-hint-length 40  ;; otherwise some types can get way out of hand
         )
  )
#+end_src

configre dap-mode for rust

#+begin_src elisp
(after! (rust-mode dap-mode)
  (dap-register-debug-template "Rust::GDB Run Configuration"
                               (list :type "gdb"
                                     :request "launch"
                                     :name "GDB::Run"
                                     :gdbpath "rust-gdb"
                                     :target nil
                                     :cwd nil)))
#+end_src

** Nix

set alejandra as the formatter

#+begin_src elisp
(after! nix-mode
  (set-formatter! 'alejandra '("alejandra" "--quiet") :modes '(nix-mode)))
#+end_src

Disable formatting with lsp

#+begin_src elisp
(setq-hook! 'nix-mode-hook +format-with-lsp nil)
#+end_src

** MQL
:PROPERTIES:
:ID:       c3da477e-b64b-4a50-af87-5fdec1fd62ab
:END:

#+BEGIN_SRC elisp
(add-to-list 'auto-mode-alist '("\\.mq[45h]\\'" . cpp-mode))
#+END_SRC

** Gitlab-CI
:PROPERTIES:
:ID:       2e1016eb-5a16-464e-a8bb-2a458f26db3d
:END:

#+BEGIN_SRC elisp
;; (use-package! gitlab-ci-mode
;;   :mode ".gitlab-ci.yml"
;;   )

;; (use-package! gitlab-ci-mode-flycheck
;;   :after flycheck gitlab-ci-mode
;;   :init
;;   (gitlab-ci-mode-flycheck-enable))
#+END_SRC

** Kubernetes
:PROPERTIES:
:ID:       fd4fae8c-3a70-449f-b3d5-52c25f76ec0a
:END:


#+begin_src elisp :tangle packages.el
(package! kubernetes :disable t)
(package! kubernetes-evil :disable t)
(package! kubernetes-helm :disable t)
(package! k8s-mode :disable t)
#+end_src

#+begin_src elisp
(use-package! kubernetes
  :commands (kubernetes-overview))
#+end_src

#+begin_src elisp
(use-package! kubernetes-evil
  :after kubernetes)
#+end_src

#+begin_src elisp
(use-package! kubernetes-helm
  :commands kubernetes-helm-status)
#+end_src

#+begin_src elisp
(use-package! k8s-mode
  :after yaml-mode
  :hook (k8s-mode . yas-minor-mode))
#+end_src

** SQL
:PROPERTIES:
:ID:       4efebc11-28ba-4f18-a758-a4af693d6f69
:END:

#+begin_src elisp :tangle packages.el
(package! sql-indent)
#+end_src

#+begin_src elisp
(use-package! sql-indent
  :after sql-mode
)
#+end_src

** Database Interface (edbi)
:PROPERTIES:
:ID:       e54ac6a8-7cf4-47ea-abe6-500512022534
:END:

[[roam:edbi setup]]

EDBI has some dependencies has some dependencies
[[https://github.com/kiwanami/emacs-edbi#installation][Installation Instructions]]

#+begin_src elisp :tangle packages.el
(package! edbi :disable t)
(package! edbi-minor-mode :disable t)
#+end_src

#+begin_src elisp
(use-package! edbi
  :commands 'edbi:open-db-viewer
  )
#+end_src

#+begin_src elisp

(use-package! edbi-minor-mode
  :after sql-mode
  :hook sql-mode-hook
  )
;; (add-hook 'sql-mode-hook 'edbi-minor-mode)
#+end_src

** Practice coding with Exercism

[[https://exercism.org][Exercism]] is a platform for learning various programing languages by solving
small exercises. The exercises can can be solved locally.

[[https://exercism.org/docs/using/solving-exercises/working-locally][Local Setup Instructions]]

#+begin_src elisp :tangle packages.el
(package! exercism-mode :recipe (:host github :repo "timotheosh/exercism-mode") :disable t)
#+end_src

#+begin_src elisp
(use-package! exercism-mode
  :after projectile
  :if (executable-find "exercism")
  :commands exercism
  :config (exercism-mode +1)
  :custom (exercism-web-browser-function 'browse-url))
#+end_src

** Javascript | Typescript
