config.org
*** Jest Testing Framework

#+begin_src elisp :tangle packages.el
(package! jest)
#+end_src

#+begin_src elisp
(map! :after rjsx-mode
      :map rjsx-mode-map
      :localleader
      :prefix ("t" "test")
      "f" #'jest-file
      "t" #'jest-function
      "k" #'jest-file-dwim
      "m" #'jest-repeat
      "p" #'jest-popup)
#+end_src

** Perl

always use the better cperl-mode instead of perl-mode.
This will be the default in Emacs 30 (if I remember correctly)

#+begin_src elisp
(add-to-list 'major-mode-remap-alist '(perl-mode . cperl-mode))
#+end_src

** Logview

#+begin_src elisp :tangle packages.el
(package! logview :disable t)
#+end_src

#+begin_src elisp
(use-package! logview
  :commands logview-mode
  :config (setq truncate-lines t)
  (map! :map logview-mode-map
        "j" #'logview-next-entry
        "k" #'logview-previous-entry))
#+end_src

The default keymap binds directly to ~f t T a A ...~
switch to evil-emacs-mode ~C-z~ to use the keybindings.

** Spell- Grammer Checking
*** LTEX

#+begin_src elisp :tangle packages.el
(package! lsp-ltex
  :disable t
  )
#+end_src

manually add adoc-mode to the list.. I don't like that...

#+begin_src elisp
;; (add-to-list 'lsp-ltex-active-modes 'adoc-mode t)
(setq lsp-ltex-active-modes '(text-mode bibtex-mode context-mode latex-mode markdown-mode org-mode rst-mode adoc-mode))
#+end_src

#+begin_src elisp
(use-package! lsp-ltex
  :after ;; (lsp-mode adoc-mode)
        lsp-ltex-active-modes
  :hook (adoc-mode . (lambda ()
                       (require 'lsp-ltex)
                       (lsp-deferred)))  ; or lsp-deferred
  :init
  (setq lsp-ltex-server-store-path "~/.nix-profile/bin/ltex-ls"
        lsp-ltex-version "16.0.0"
        lsp-ltex-mother-tongue "de-AT"
        lsp-ltex-user-rules-path (doom-path doom-private-dir "lsp-ltex")))
#+end_src

** Proxmox development
:PROPERTIES:
:header-args:elisp: :tangle no
:END:

_tangle is disabled for the entire section_ and is only kept as a reference!

*** AsciiDoc (adoc)

#+begin_src elisp :tangle packages.el
;; bbatsov/adoc-mode
(package! adoc-mode)
#+end_src

~TODO~ adoc-mode requires org due to inhereting the theme

#+begin_src elisp
(use-package! adoc-mode
  :defer t
  :config
  (map! :map adoc-mode-map
        :localleader
        :desc "consult headers in this file" "." #'consult-imenu
        :desc "consult headers in project" "/" #'consult-imenu-multi
        "p" #'treemacs-find-tag))
#+end_src

#+begin_src elisp
(after! lsp-mode
  (add-to-list 'lsp-language-id-configuration '(adoc-mode . "org") t))
#+end_src

*** Magit Default Sign-Off commits

#+begin_src elisp
(after! magit
  (setq transient-values  '((magit-commit "--signoff"))))
#+end_src

*** Javascript indentation style

This is still broken...

#+begin_src elisp
(setq-hook! 'rjsx-mode-hook
  indent-tabs-mode t
  tab-width 8)

(setq-hook! 'js-mode-hook
  indent-tabs-mode t
  tab-width 8)

(setq-hook! 'js2-mode-hook
  indent-tabs-mode t
  tab-width 8)
#+end_src

#+begin_src elisp
(after! js
  (setq js-indent-level 4
        js-jsx-indent-level 4
        tab-width 8))
#+end_src

*** Perl intendation style

#+begin_src elisp
(setq! cperl-indent-level 4
       cperl-close-paren-offset -4
       cperl-continued-statement-offset 4
       cperl-indent-parens-as-block t)
#+end_src

Proxmox specific Perl indentation style using a tab where 8 spaces would be used.

#+begin_src elisp
(setq-hook! 'cperl-mode-hook
  tab-width 8
  indent-tabs-mode t)
#+end_src

*** notmuch

#+begin_src elisp
(after! notmuch
  (setq +notmuch-sync-backend 'mbsync
        +notmuch-mail-folder "~/Mail"
        notmuch-draft-folder "proxmox/Entw&APw-rfe"
        notmuch-fcc-dirs "proxmox/Sent"
        notmuch-mua-cite-function 'message-cite-original-without-signature
        notmuch-mua-compose-in 'current-window
        notmuch-show-logo nil
        notmuch-hello-indent 0  ;; do not indent because it works better with evil navigation
        notmuch-tag-formats '(("unread" (propertize tag 'face 'notmuch-tag-unread)))
        notmuch-saved-searches
        '((:key "i" :name "ó°‡® inbox"   :query "tag:inbox and not tag:archive")
          (:key "f" :name "ï± flagged" :query "tag:flagged")
          (:key "m" :name "ó°‡® my PRs"  :query "tag:my-pr and not tag:archive and not tag:killed and not tag:deleted and not tag:inbox")
          (:key "w" :name "ó°‡® watch"   :query "tag:watch and not tag:my-pr and not tag:archive and not tag:killed and not tag:deleted and not tag:inbox")
          (:key "t" :name "ó°‡® team"    :query "tag:lists/team and not tag:archive and not tag:inbox")
          (:key "b" :name "ï†ˆ My Bugs" :query "tag:bugs and tag:to-me and not tag:archive and not tag:inbox")
          (:key "s" :name "î—¿ support (new)" :query "tag:support-new and not tag:archive and not tag:killed")
          (:key "r" :name "î¬œ review"  :query "tag:review and not tag:archive and not tag:killed and not tag:inbox")
          (:key "d" :name "ï“§ drafts"  :query "tag:draft and not tag:archive and not tag:deleted")
          ;; (:key ">" :name "ó°—• sent"    :query "tag:sent and not tag:archive")
          (:key "M" :name "îª˜ my PRs" :query "tag:my-pr and not tag:killed and not tag:deleted and not tag:inbox")
          (:key "W" :name "îª˜ watch" :query "tag:watch and not tag:killed and not tag:deleted and not tag:inbox")
          (:key "B" :name "îª¯ Bugzilla" :query "tag:bugs and not tag:archive and not tag:inbox")
          (:key "S" :name "îªƒ support" :query "tag:support and not tag:archive and not tag:killed and not tag:inbox")
          (:key "P" :name "ï’‡ pkgs"    :query "tag:lists/pkgs and not tag:archive and not tag:inbox"))
        notmuch-archive-tags '("+archive" "-inbox" "-unread")
        +notmuch-spam-tags '("+spam" "-inbox" "-unread")
        +notmuch-delete-tags '("+trash" "-inbox" "-unread")

        stfl/notmuch-unwatch-tags (append notmuch-archive-tags '("-my-pr" "-watch" "-review"))
        stfl/notmuch-kill-tags (cons "+killed" stfl/notmuch-unwatch-tags)

        message-hidden-headers nil  ;; don't hide any headers to verify In-reply-to and Reference headers
        notmuch-mua-hidden-headers nil

        message-sendmail-f-is-evil 't
        message-sendmail-extra-arguments '("--read-envelope-from")
        message-send-mail-function 'message-send-mail-with-sendmail
        sendmail-program "msmtp")
  (add-to-list '+word-wrap-disabled-modes 'notmuch-show-mode)
  (add-hook! 'notmuch-hello-mode-hook #'read-only-mode)
  (defun +notmuch-get-sync-command ()
    "mbsync -a && notmuch new && afew -n -t"))
#+end_src

Additional functions to apply tags according to my workflow

#+begin_src elisp
(after! notmuch
  (defun stfl/notmuch-search-unwatch-thread (&optional unarchive beg end)
    (interactive (cons current-prefix-arg (notmuch-interactive-region)))
    (let ((notmuch-archive-tags stfl/notmuch-unwatch-tags))
      (notmuch-search-archive-thread unarchive beg end)))

  (defun stfl/notmuch-search-kill-thread (&optional unarchive beg end)
    (interactive (cons current-prefix-arg (notmuch-interactive-region)))
    (let ((notmuch-archive-tags stfl/notmuch-kill-tags))
      (notmuch-search-archive-thread unarchive beg end)))
  )
#+end_src

Use the (almost) default keybindings in evil normal-mode

#+begin_src elisp
(map! :after notmuch
      :map notmuch-common-keymap
      :n "?" #'notmuch-help
      :map notmuch-show-mode-map
      ;; :g "<mouse-1>" #'notmuch-show-toggle-message
      ;; :g "<mouse-2>" #'notmuch-show-toggle-message
      ;; :desc "toggle show message" :n "<tab>" #'notmuch-show-toggle-message
      ;; :desc "toggle show message" :n "C-<tab>" #'notmuch-show-open-or-close-all
      :g "C-c C-e" #'notmuch-show-resume-message
      :n "ge" #'notmuch-show-resume-message
      ;; :n "A" '(Î»! (notmuch-search-tag-all "-archive -my-pr -watch"))  ;; TODO need to tag ENTIRE thread oterhwise it will be tagged again with afew
      :map notmuch-tree-mode-map
      :g "C-c C-e" #'notmuch-tree-resume-message
      :n "ge" #'notmuch-tree-resume-message
      :n "A" (Î»! (notmuch-tree-tag-thread stfl/notmuch-unwatch-tags))
      :n "K" (Î»! (notmuch-tree-tag-thread stfl/notmuch-kill-tags))
      :map notmuch-search-mode-map
      :n "A" #'stfl/notmuch-search-unwatch-thread
      :n "K" #'stfl/notmuch-search-kill-thread
      ;; :map notmuch-message-mode-map
      ;; :n "SPC f s" #'notmuch-draft-save
      )
#+end_src

#+begin_src elisp
(after! notmuch
  (defun stfl/notmuch-hello-update-background ()
    "Update notmuch-hello buffer. If we are in another frame, allow switch to it so it will be formatted correctly."
    (let ((no-display (eq (selected-frame)
                          (window-frame (display-buffer "*notmuch-hello*")))))
      (notmuch-hello no-display)))

  (run-with-idle-timer 60 t #'stfl/notmuch-hello-update-background))
#+end_src

** ssh-config-mode

#+begin_src elisp :tangle packages.el
(package! ssh-config-mode
  ;; :recipe (:host github
           ;; :repo "jhgorrell/ssh-config-mode-el"
           ;; :files ("*.el" "out"))
  )
#+end_src

#+begin_src elisp
(use-package! ssh-config-mode :defer t)
#+end_src

** BitBake

#+begin_src elisp :tangle packages.el
(package! bitbake-ts-mode)
#+end_src

#+begin_src elisp
(use-package! bitbake-ts-mode
  :config (add-to-list 'auto-mode-alist '("\\.inc$" . bitbake-ts-mode)))
#+end_src

Setup custom bitbake language server for bitbake-ts-mode via lsp-bridge.

#+begin_src elisp
(after! lsp-bridge
  (add-to-list 'lsp-bridge-single-lang-server-mode-list
               ;; '(bitbake-ts-mode . "bitbake-language-server")
               '(bitbake-ts-mode . "language-server-bitbake")))
#+end_src

lsp-bridge requires a json config file to configure the language server.
=NOTE:= the ~:tangle "langserver/<server>.json"~ needs to match the alist above ~(<mode> . <server>)~

#+begin_src js :eval no :tangle "langserver/bitbake-language-server.json"
{
    "name": "bitbake-language-server",
    "languageId": "bitbake",
    "command": [ "bitbake-language-server" ],
    "settings": {}
}
#+end_src

Alternative bitbake lsp from the vscode-bitbake project.

#+begin_src js :eval no :tangle "langserver/language-server-bitbake.json"
{
    "name": "language-server-bitbake",
    "languageId": "bitbake",
    "command": [ "/home/stefan/node_modules/language-server-bitbake/out/server.js", "--stdio" ],
    "settings": {}
}
#+end_src

    "command": [ "language-server-bitbake", "--stdio" ],

#+begin_src elisp :tangle packages.el
;; (package! bitbake-modes
;;   :recipe (:host bitbucket
;;            :repo "olanilsson/bitbake-modes"
;;            ;; :files ("*.el")
;;            ))
#+end_src

#+begin_src elisp
;; (use-package! bitbake-modes
;;   :config (add-to-list 'auto-mode-alist '("\\.inc$" . bitbake-mode))
;;   :defer t)
#+end_src

#+begin_src elisp :tangle packages.el
;; (package! bb-mode
;;   :recipe (:host github
;;            :repo "mferland/bb-mode"
;;            :files ("*.el")))
#+end_src

#+begin_src elisp
;; (use-package bb-modes
;;   :init
;;   (add-to-list 'auto-mode-alist '("\\.bb" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\.bbappend" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\.bbclass" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\conf/.conf" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\.inc$" . bb-mode))
;;   :config
;;   (bitbake-lsp-register))
#+end_src

#+begin_src elisp
;; (defun bitbake-lsp-register ()
;;   "Register to start using this language server."
;;   (interactive)
;;   (add-to-list 'lsp-language-id-configuration '(bb-mode . "bitbake"))
;;     (lsp-register-client
;;      (make-lsp-client :new-connection
;;                       (lsp-stdio-connection `(,(executable-find "bitbake-language-server")))
;;                       :activation-fn (lsp-activate-on "*.bb" "*.bbappend" "*.bbclass" "*.inc" "conf/*.conf")
;;                       :server-id 'bitbake)))
#+end_src

** Meson build system

#+begin_src elisp :tangle packages.el
(package! meson-mode :disable t)
#+end_src

#+begin_src elisp
(use-package! meson-mode
  :config (add-hook! 'meson-mode-hook #'company-mode))
#+end_src

