config.el

(map! :after rjsx-mode
      :map rjsx-mode-map
      :localleader
      :prefix ("t" "test")
      "f" #'jest-file
      "t" #'jest-function
      "k" #'jest-file-dwim
      "m" #'jest-repeat
      "p" #'jest-popup)

(add-to-list 'major-mode-remap-alist '(perl-mode . cperl-mode))

(use-package! logview
  :commands logview-mode
  :config (setq truncate-lines t)
  (map! :map logview-mode-map
        "j" #'logview-next-entry
        "k" #'logview-previous-entry))

;; (add-to-list 'lsp-ltex-active-modes 'adoc-mode t)
(setq lsp-ltex-active-modes '(text-mode bibtex-mode context-mode latex-mode markdown-mode org-mode rst-mode adoc-mode))

(use-package! lsp-ltex
  :after ;; (lsp-mode adoc-mode)
        lsp-ltex-active-modes
  :hook (adoc-mode . (lambda ()
                       (require 'lsp-ltex)
                       (lsp-deferred)))  ; or lsp-deferred
  :init
  (setq lsp-ltex-server-store-path "~/.nix-profile/bin/ltex-ls"
        lsp-ltex-version "16.0.0"
        lsp-ltex-mother-tongue "de-AT"
        lsp-ltex-user-rules-path (doom-path doom-private-dir "lsp-ltex")))

(use-package! ssh-config-mode :defer t)

(use-package! bitbake-ts-mode
  :config (add-to-list 'auto-mode-alist '("\\.inc$" . bitbake-ts-mode)))

(after! lsp-bridge
  (add-to-list 'lsp-bridge-single-lang-server-mode-list
               ;; '(bitbake-ts-mode . "bitbake-language-server")
               '(bitbake-ts-mode . "language-server-bitbake")))

;; (use-package! bitbake-modes
;;   :config (add-to-list 'auto-mode-alist '("\\.inc$" . bitbake-mode))
;;   :defer t)

;; (use-package bb-modes
;;   :init
;;   (add-to-list 'auto-mode-alist '("\\.bb" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\.bbappend" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\.bbclass" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\conf/.conf" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\.inc$" . bb-mode))
;;   :config
;;   (bitbake-lsp-register))

;; (defun bitbake-lsp-register ()
;;   "Register to start using this language server."
;;   (interactive)
;;   (add-to-list 'lsp-language-id-configuration '(bb-mode . "bitbake"))
;;     (lsp-register-client
;;      (make-lsp-client :new-connection
;;                       (lsp-stdio-connection `(,(executable-find "bitbake-language-server")))
;;                       :activation-fn (lsp-activate-on "*.bb" "*.bbappend" "*.bbclass" "*.inc" "conf/*.conf")
;;                       :server-id 'bitbake)))

(use-package! meson-mode
  :config (add-hook! 'meson-mode-hook #'company-mode))

(after! projectile
