config.org
** C/C++

#+begin_src elisp
(after! projectile
  (add-to-list 'projectile-globally-ignored-directories ".ccls-cache"))
#+end_src

#+begin_src elisp
(defun run-ctest (arg)
  (interactive "P")
  (let ((projectile-project-test-cmd "cmake --build build && ctest --test-dir build --output-on-failure --rerun-failed"))
    (projectile-test-project arg)))


(map! ;;:after cc-mode
      :mode c++-mode
      :map c++-mode-map
      :localleader 
      :prefix ("t" "test")
      :n "t" #'run-ctest
      ;; :n "t" #'gtest-run-at-point
      ;; :n "T" #'gtest-run
      ;; :n "l" #'gtest-list
      )

#+end_src

#+begin_src elisp
;; (after! lsp-mode
;;   (set-lsp-priority! 'ccls 2))
#+end_src

#+begin_src elisp :tangle packages.el
;; (package! gtest-mode
;;   :recipe (:host github
;;            :repo "ppatoria/elisp"
;;            :files ("gtest-mode/*.el")))
#+end_src

#+begin_src elisp
;; (use-package! gtest-mode
;;   ;; :after c++-mode
;;   :config
;;   (map! :map gtest-mode-map
;;         :localleader 
;;         :prefix ("t" "test")
;;         :n "t" #'gtest-run-at-point
;;         :n "T" #'gtest-run
;;         :n "l" #'gtest-list))
#+end_src

** Turbo Log

#+begin_src elisp :tangle packages.el
(package! turbo-log :recipe (:host github :repo "artawower/turbo-log"))
#+end_src

#+begin_src elisp
(use-package! turbo-log
  :after prog-mode
  :config
  (map! :leader
        "l l" #'turbo-log-print
        "l i" #'turbo-log-print-immediately
        "l h" #'turbo-log-comment-all-logs
        "l s" #'turbo-log-uncomment-all-logs
        "l [" #'turbo-log-paste-as-logger
        "l ]" #'turbo-log-paste-as-logger-immediately
        "l x" #'turbo-log-delete-all-logs)
  (setq turbo-log-msg-format-template "\"ðŸš€: %s\""
        turbo-log-allow-insert-without-tree-sitter-p t))
#+end_src

** just

#+begin_src elisp :tangle packages.el
(package! just-mode)
#+end_src

#+begin_src elisp
(use-package just-mode)
#+end_src

#+begin_src elisp :tangle packages.el
(package! justl :recipe (:host github :repo "psibi/justl.el") :disable t)
#+end_src

#+begin_src elisp
(use-package justl
  :disabled
  )
  ;; :config
  ;; (map! :n "e" 'justl-exec-recipe))
#+end_src

* Collaboration and VCS
** Directory tree diff - ztree
:PROPERTIES:
:ID:       74eab92f-af80-47ab-b6ac-0712d7e87699
:END:

#+begin_src elisp :tangle packages.el
(package! ztree :disable t)
#+end_src

#+BEGIN_SRC elisp
(use-package! ztree)
#+END_SRC

** Magit
*** Enable Gravatars

This will enable gravatars when viewing commits. The service used by default is [[https://www.libravatar.org/][Libravatar]].
#+BEGIN_SRC elisp
;; (setq magit-revision-show-gravatars '("^Author:     " . "^Commit:     "))
#+END_SRC

*** Enable granular diff-highlights for all hunks

By default, changes are highlighted *line-wise* for all but the selected hunk. This
has [[https://magit.vc/manual/magit/Performance.html][performance reasons]]. You can enable character-wise highlights for all
visible hunks with:

#+BEGIN_SRC elisp
(after! magit
  (setq magit-diff-refine-hunk 'all))
#+END_SRC

*** Forge
:PROPERTIES:
:ID:       0ed4b14f-b9cd-4b13-b17e-633213db7418
:END:

display more columns in forge list topic
#+BEGIN_SRC elisp
(after! forge (setq forge-topic-list-columns
                    '(("#" 5 t (:right-align t) number nil)
                      ("Title" 60 t nil title  nil)
                      ("State" 6 t nil state nil)
                      ("Marks" 8 t nil marks nil)
                      ("Labels" 8 t nil labels nil)
                      ("Assignees" 10 t nil assignees nil)
                      ("Updated" 10 t nill updated nil))))
#+END_SRC

*** with-editor

# #+BEGIN_SRC elisp
# (use-package! with-editor
#   :after magit
#   :config
#   (define-key (current-global-map)
#     [remap async-shell-command] 'with-editor-async-shell-command)
#   (define-key (current-global-map)
#     [remap shell-command] 'with-editor-shell-command)

#   (add-hook 'shell-mode-hook  'with-editor-export-editor)
#   (add-hook 'term-exec-hook   'with-editor-export-editor)
#   (add-hook 'eshell-mode-hook 'with-editor-export-editor)

#   (add-hook 'shell-mode-hook 'with-editor-export-git-editor)
# )
# #+END_SRC

*** magit-todos

#+begin_src elisp :tangle packages.el
(package! magit-todos :disable t)
#+end_src

activate magit-todo to display the TODOs section in magit buffer

#+begin_src elisp
(use-package! magit-todos
  :after magit
  :config
  (setq! magit-todos-exclude-globs '(".git/" "node_modules/"))
  (magit-todos-mode 1))
#+end_src

** E-Mail
:PROPERTIES:
:ID:       8e96aa1e-257e-4826-a0bb-6c3be8537fe9
:END:

*** mailscripts.el

https://github.com/spwhitton/mailscripts/blob/master/mailscripts.el

The original purpose of this package was to make it easy to use the small
mail-handling utilities shipped in Debian's 'mailscripts' package from
within Emacs.  It now also contains some additional, thematically-related
utilities which don't invoke any of those scripts.

Entry points you might like to look at if you're new to this package:
mailscripts-prepare-patch, notmuch-slurp-debbug,
notmuch-extract-{thread,message}-patches{,-to-project}.


#+begin_src elisp :tangle packages.el
;; (package! mailscripts.el
;;   :recipe (:host github :repo "spwhitton/mailscripts" :files ("mailscripts.el")))
#+end_src

*** mu4e
:PROPERTIES:
:ID:       9caa475f-fe10-4a07-9696-c8ff031a1fd4
:END:

#+begin_src elisp
;; (set-email-account! "gmail"
;;   '((mu4e-sent-folder       . "/gmail/[Google Mail]/Gesendet")
;;     (mu4e-drafts-folder     . "/gmail/[Google Mail]/Entw&APw-rfe")
;;     (mu4e-trash-folder      . "/gmail/[Google Mail]/Trash")
;;     (mu4e-refile-folder     . "/gmail/[Google Mail]/Alle Nachrichten")
;;     (smtpmail-smtp-user     . "ste.lendl@gmail.com")
;;     ;; (+mu4e-personal-addresses . "ste.lendl@gmail.com")
;;     ;; (mu4e-compose-signature . "---\nStefan Lendl")
;;     )
;;   t)
#+end_src

#+begin_src elisp
;; (set-email-account! "pulswerk"
;;   '((mu4e-sent-folder       . "/pulswerk/Sent Items")
;;     (mu4e-drafts-folder     . "/pulswerk/Drafts")
;;     (mu4e-trash-folder      . "/pulswerk/Deleted Items")
;;     (mu4e-refile-folder     . "/pulswerk/Archive")
;;     (smtpmail-smtp-user     . "lendl@pulswerk.at")
;;     ;; (+mu4e-personal-addresses . "lendl@pulswerk.at")
;;     ;; (mu4e-compose-signature . "---\nStefan Lendl")
;;     )
;;   t)
#+end_src

#+begin_src elisp
(after! mu4e
  ;; (setq +mu4e-gmail-accounts '(("ste.lendl@gmail.com" . "/gmail")))
  (setq mu4e-context-policy 'ask-if-none
        mu4e-compose-context-policy 'always-ask)

  (setq mu4e-maildir-shortcuts
    '((:key ?g :maildir "/gmail/Inbox"   )
      (:key ?p :maildir "/pulswerk/INBOX")
      (:key ?u :maildir "/gmail/Categories/Updates")
      (:key ?j :maildir "/pulswerk/Jira"  )
      (:key ?l :maildir "/pulswerk/Gitlab" :hide t)
      ))

  (setq mu4e-bookmarks
        '(
          (:key ?i :name "Inboxes" :query "not flag:trashed and (m:/gmail/Inbox or m:/pulswerk/INBOX)")
          (:key ?u :name "Unread messages"
           :query
           "flag:unread and not flag:trashed and (m:/gmail/Inbox or m:/gmail/Categories/* or m:/pulswerk/INBOX or m:\"/pulswerk/Pulswerk Alle\" or m:/pulswerk/Jira or m:/pulswerk/Gitlab)")
          (:key ?p :name "pulswerk Relevant Unread" :query "flag:unread not flag:trashed and (m:/pulswerk/INBOX or m:\"/pulswerk/Pulswerk Alle\" or m:/pulswerk/Jira or m:/pulswerk/Gitlab)")
          (:key ?g :name "gmail Relevant Unread" :query "flag:unread not flag:trashed and (m:/gmail/Inbox or m:/gmail/Categories/*)")
          ;; (:key ?t :name "Today's messages" :query "date:today..now" )
          ;; (:key ?y :name "Yesterday's messages" :query "date:2d..1d")
          ;; (:key ?7 :name "Last 7 days" :query "date:7d..now" :hide-unread t)
          ;; ;; (:name "Messages with images" :query "mime:image/*" :key 112)
          ;; (:key ?f :name "Flagged messages" :query "flag:flagged")
          ;; (:key ?g :name "Gmail Inbox" :query "maildir:/gmail/Inbox and not flag:trashed")
          ))
  )
#+end_src

set up the query for mu4e-alert to also limit the search range
#+begin_src elisp
(after! mu4e-alert
  (setq mu4e-alert-interesting-mail-query
           "flag:unread and not flag:trashed and (m:/gmail/Inbox or m:/gmail/Categories/Updates or m:/pulswerk/INBOX or m:\"/pulswerk/Pulswerk Alle\" or m:/pulswerk/Jira or m:/pulswerk/Gitlab)"))
#+end_src

#+begin_src elisp
(after! mu4e
  (setq mu4e-headers-fields
        '((:flags . 6)
          (:account-stripe . 2)
          (:from-or-to . 25)
          (:folder . 10)
          (:recipnum . 2)
          (:subject . 80)
          (:human-date . 8))
        +mu4e-min-header-frame-width 142
        mu4e-headers-date-format "%d/%m/%y"
        mu4e-headers-time-format "â§– %H:%M"
        mu4e-headers-results-limit 1000
        mu4e-index-cleanup t)

  (defvar +mu4e-header--folder-colors nil)
  (appendq! mu4e-header-info-custom
            '((:folder .
               (:name "Folder" :shortname "Folder" :help "Lowest level folder" :function
                (lambda (msg)
                  (+mu4e-colorize-str
                   (replace-regexp-in-string "\\`.*/" "" (mu4e-message-field msg :maildir))
                   '+mu4e-header--folder-colors)))))))
#+end_src

*** Sending Mail
:PROPERTIES:
:ID:       14a0b646-f10a-401a-824f-402052202859
:END:

#+begin_src elisp
(after! mu4e
  (setq sendmail-program "/usr/bin/msmtp"
        send-mail-function #'smtpmail-send-it
        message-sendmail-f-is-evil t
        message-sendmail-extra-arguments '("--read-envelope-from") ; , "--read-recipients")
        message-send-mail-function #'message-send-mail-with-sendmail))
#+end_src

